### Terraform Plan ✅ Succeeded

**Result:** No changes.

<details><summary>Show plan output</summary>

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.devops.aws_ssm_parameter.github_token has changed
  ~ resource "aws_ssm_parameter" "github_token" {
        id        = "/devops/github_token"
        name      = "/devops/github_token"
      ~ value     = (sensitive value)
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.devops.github_actions_secret.shared_secrets["auth-service.ARTIFACT_BUCKET"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "ARTIFACT_BUCKET"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["auth-service.AWS_ACCESS_KEY_ID"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["auth-service.AWS_REGION"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "AWS_REGION"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["auth-service.AWS_SECRET_ACCESS_KEY"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.devops.github_actions_secret.shared_secrets["auth-service.GH_FLYFLOW_TOKEN"] will be created
  + resource "github_actions_secret" "shared_secrets" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "auth-service"
      + secret_name     = "GH_FLYFLOW_TOKEN"
      + updated_at      = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

```
</details>